src/main/resources/request_example/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://arpi.io/game/gol-web-service">
   <soapenv:Header/>
   <soapenv:Body>
        <ns2:getTableStateRequest xmlns:ns2="http://arpi.io/game/gol-web-service">
            <tableMap>
                <ns2:list>
                    <ns2:key>0</ns2:key>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                </ns2:list>
                <ns2:list>
                    <ns2:key>1</ns2:key>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                </ns2:list>
                <ns2:list>
                    <ns2:key>2</ns2:key>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>  
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list> 
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>      
                </ns2:list>
                <ns2:list>
                    <ns2:key>3</ns2:key>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>X</ns2:list>
                    <ns2:list>X</ns2:list>
                    <ns2:list>X</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                </ns2:list>
                <ns2:list>
                    <ns2:key>4</ns2:key>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                </ns2:list>
                <ns2:list>
                    <ns2:key>5</ns2:key>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                </ns2:list>
                <ns2:list>
                    <ns2:key>6</ns2:key>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                </ns2:list>
                <ns2:list>
                    <ns2:key>7</ns2:key>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                </ns2:list>
                <ns2:list>
                    <ns2:key>8</ns2:key>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                </ns2:list>
                <ns2:list>
                    <ns2:key>9</ns2:key>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                    <ns2:list>O</ns2:list>
                </ns2:list>
            </tableMap>
            <ns2:steps>10</ns2:steps>
        </ns2:getTableStateRequest>
   </soapenv:Body>
</soapenv:Envelope>